src/Documents/ВыводСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>ВыводСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДоступныеСредства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПлатежнаяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПлатежныеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектИнвестиций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыИнвестиций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвестированыВПроект</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ДоступныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<AccumulationRegister>
		<Properties>
			<Name>ДоступныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПлатежнаяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПлатежныеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/ВыводСредств/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ДоступныеСредства.Записывать = Истина;
	Движения.ДоступныеСредства.БлокироватьДляИзменения = Истина;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДоступныеСредстваОстатки.ПлатежнаяСистема КАК ПлатежнаяСистема,
	|	ДоступныеСредстваОстатки.Валюта КАК Валюта,
	|	ДоступныеСредстваОстатки.СуммаВВалютеОстаток КАК СуммаВВалюте
	|ИЗ
	|	РегистрНакопления.ДоступныеСредства.Остатки(
	|			&Дата,
	|			ПлатежнаяСистема = &ПлатежнаяСистема
	|				И Валюта = &Валюта) КАК ДоступныеСредстваОстатки");
	Запрос.УстановитьПараметр("Валюта",Валюта);
	Запрос.УстановитьПараметр("ПлатежнаяСистема",ПлатежнаяСистема);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	ВыборкаДетали = Запрос.Выполнить().Выбрать();
	
	ОсталосьСписать = Сумма;
	Пока ВыборкаДетали.Следующий() Цикл
		
		Движение = Движения.ДоступныеСредства.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ПлатежнаяСистема = ПлатежнаяСистема;
		Движение.Валюта = Валюта;
		Движение.СуммаВВалюте = Сумма;
		
	КонецЦикла;
	
	Движения.ДоступныеСредства.Записать();

	Если Не КонтрольОстатков.ОстаткиВалютыДостаточны(ПлатежнаяСистема, Валюта, Дата, "Объект.Сумма", Сумма) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
